# Задание-1:
# Дан список, заполненный произвольными целыми числами.
# Получить новый список, элементы которого будут
# квадратами элементов исходного списка
# [1, 2, 4, 0] --> [1, 4, 16, 0]

a = [1, 2, 4, 0]
b = [a**2 for a in a]
print(b)

# Задание-2
list2 = ['яблоко', 'банан', 'киви', 'арбуз']
list = ["апельсн", "лимон", "гранат",'яблоко', 'банан']
list3 = [x for x in list2 if x in list]
print(list3)

# Задание - 3
import random

x = [random.randint(-100,100) for i in range(50)]
a = []
for i in x:
    if i % 3 == 0:
        if i % 4 != 0:
            if i > 0:
                a.append(i)
print(x)
print(a)